Repository: moxi000/kelivo
Catalog: Kelivo-Swift/Kelivo/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# homePageDeleteMessage
source: Delete Message
zh_hans: 删除消息
zh_hant: 刪除訊息

# homePageDeleteMessageConfirm
source: Are you sure you want to delete this message? This cannot be undone.
zh_hans: 确定要删除这条消息吗？此操作不可撤销。
zh_hant: 確定要刪除這條訊息嗎？此操作不可撤銷。

# homePageDone
source: Done
zh_hans: 完成
zh_hant: 完成

# homePageDropToUpload
source: Drop files to upload
zh_hans: 将文件拖拽到此处上传
zh_hant: 將檔案拖曳到此處以上傳

# homePagePleaseSelectModel
source: Please select a model first
zh_hans: 请先选择模型
zh_hant: 請先選擇模型

# homePagePleaseSetupTranslateModel
source: Please set a translation model first
zh_hans: 请先设置翻译模型
zh_hant: 請先設定翻譯模型

# homePageSelectMessagesToShare
source: Please select messages to share
zh_hans: 请选择要分享的消息
zh_hant: 請選擇要分享的訊息

# homePageTranslateFailed
source: Translation failed: %@
zh_hans: 翻译失败: %@
zh_hant: 翻譯失敗: %@

# homePageTranslating
source: Translating...
zh_hans: 翻译中...
zh_hant: 翻譯中...

# hotkeyCloseWindow
source: Close Window
zh_hans: 关闭窗口
zh_hant: 關閉視窗

# hotkeyNewTopic
source: New Topic
zh_hans: 新建话题
zh_hant: 新建話題

# hotkeyOpenSettings
source: Open Settings
zh_hans: 打开设置
zh_hant: 打開設定

# hotkeySwitchModel
source: Switch Model
zh_hans: 切换模型
zh_hant: 切換模型

# hotkeyToggleAppVisibility
source: Show/Hide App
zh_hans: 显示/隐藏应用
zh_hant: 顯示/隱藏應用

# hotkeyToggleAssistantPanel
source: Toggle Assistants
zh_hans: 切换助手显示
zh_hant: 切換助理顯示

# hotkeyToggleTopicPanel
source: Toggle Topics
zh_hans: 切换话题显示
zh_hant: 切換話題顯示

# hotkeysClearShortcut
source: Clear shortcut
zh_hans: 清除快捷键
zh_hant: 清除快捷鍵

# hotkeysPressShortcut
source: Press a shortcut
zh_hans: 按下快捷键
zh_hant: 按下快捷鍵

# hotkeysResetAll
source: Reset all to defaults
zh_hans: 重置所有快捷键为默认
zh_hant: 重置所有快捷鍵為預設

# hotkeysResetDefault
source: Reset to default
zh_hans: 重置为默认
zh_hant: 重置為預設

# htmlPreviewNotSupportedOnLinux
source: HTML preview is not supported on Linux
zh_hans: Linux 暂不支持 HTML 预览
zh_hant: Linux 暫不支援 HTML 預覽

# imagePreviewSheetSaveFailed
source: Save failed: %@
zh_hans: 保存失败: %@
zh_hant: 保存失敗: %@

# imagePreviewSheetSaveImage
source: Save Image
zh_hans: 保存图片
zh_hant: 保存圖片

# imagePreviewSheetSaveSuccess
source: Saved to gallery
zh_hans: 已保存到相册
zh_hant: 已儲存到相簿

# imageViewerPageSaveButton
source: Save Image
zh_hans: 保存图片
zh_hant: 儲存圖片

# imageViewerPageSaveFailed
source: Save failed: %@
zh_hans: 保存失败: %@
zh_hant: 儲存失敗: %@

# imageViewerPageSaveSuccess
source: Saved to gallery
zh_hans: 已保存到相册
zh_hant: 已儲存到相簿

# imageViewerPageShareButton
source: Share Image
zh_hans: 分享图片
zh_hant: 分享圖片

# imageViewerPageShareFailed
source: Share failed: %@
zh_hans: 分享失败: %@
zh_hant: 分享失敗: %@

# imageViewerPageShareFailedOpenFile
source: Unable to share, tried to open file: %@
zh_hans: 无法分享，已尝试打开文件: %@
zh_hant: 無法分享，已嘗試開啟檔案: %@

# importProviderSheetCancelButton
source: Cancel
zh_hans: 取消
zh_hant: 取消

# importProviderSheetDescription
source: Paste share strings (multi-line supported) or ChatBox JSON
zh_hans: 粘贴分享字符串（可多行，每行一个）或 ChatBox JSON
zh_hant: 貼上分享字串（可多行，每行一個）或 ChatBox JSON

# importProviderSheetFromGalleryTooltip
source: From Gallery
zh_hans: 从相册导入
zh_hant: 從相簿匯入

# importProviderSheetImportButton
source: Import
zh_hans: 导入
zh_hant: 匯入

# importProviderSheetImportFailedMessage
source: Import failed: %@
zh_hans: 导入失败: %@
zh_hant: 匯入失敗: %@

# importProviderSheetImportSuccessMessage
source: Imported %lld provider(s)
zh_hans: 已导入%lld个供应商
zh_hant: 已匯入%lld個供應商

# importProviderSheetInputHint
source: ai-provider:v1:... or JSON
zh_hans: ai-provider:v1:...
zh_hant: ai-provider:v1:...

# importProviderSheetScanQrTooltip
source: Scan QR
zh_hans: 扫码导入
zh_hant: 掃碼匯入

# importProviderSheetTitle
source: Import Provider
zh_hans: 导入供应商
zh_hant: 匯入供應商

# instructionInjectionAddTitle
source: Add Instruction Injection
zh_hans: 添加指令注入
zh_hant: 新增指令注入

# instructionInjectionAddTooltip
source: Add Instruction
zh_hans: 添加指令注入
zh_hant: 新增指令注入

# instructionInjectionBackTooltip
source: Back
zh_hans: 返回
zh_hant: 返回

# instructionInjectionDefaultTitle
source: Learning Mode
zh_hans: 学习模式
zh_hant: 學習模式

# instructionInjectionEditTitle
source: Edit Instruction Injection
zh_hans: 编辑指令注入
zh_hant: 編輯指令注入

# instructionInjectionEmptyMessage
source: No instruction injection cards yet
zh_hans: 暂无指令注入卡片
zh_hant: 暫無指令注入卡片

# instructionInjectionGroupHint
source: Optional
zh_hans: 可选
zh_hant: 可選

# instructionInjectionGroupLabel
source: Group
zh_hans: 分组
zh_hant: 分組

# instructionInjectionImportSuccess
source: Imported %lld instruction(s)
zh_hans: 已导入 %lld 个指令注入
zh_hant: 已匯入 %lld 個指令注入

# instructionInjectionImportTooltip
source: Import from files
zh_hans: 从文件导入
zh_hant: 從檔案匯入

# instructionInjectionNameLabel
source: Name
zh_hans: 名称
zh_hant: 名稱

# instructionInjectionPromptLabel
source: Prompt
zh_hans: 提示词
zh_hant: 提示詞

# instructionInjectionSheetSubtitle
source: Choose a prompt to apply before chatting
zh_hans: 为当前对话选择并应用一条指令提示词
zh_hant: 為目前對話選擇並套用一條指令提示詞

# instructionInjectionTitle
source: Instruction Injection
zh_hans: 指令注入
zh_hant: 指令注入

# instructionInjectionUngroupedGroup
source: Ungrouped
zh_hans: 未分组
zh_hant: 未分組

# languageDisplayFrench
source: French
zh_hans: Français
zh_hant: Français

# languageDisplayGerman
source: German
zh_hans: Deutsch
zh_hant: Deutsch

# languageDisplayItalian
source: Italian
zh_hans: Italiano
zh_hant: Italiano

# languageDisplayJapanese
source: Japanese
zh_hans: 日本語
zh_hant: 日本語

# languageDisplayKorean
source: Korean
zh_hans: 한국어
zh_hant: 한국어

# languageDisplaySimplifiedChinese
source: Simplified Chinese
zh_hans: 简体中文
zh_hant: 简体中文

# languageDisplaySpanish
source: Spanish
zh_hans: Español
zh_hant: Español

# languageDisplayTraditionalChinese
source: Traditional Chinese
zh_hans: 繁體中文
zh_hant: 繁體中文

# languageSelectSheetClearButton
source: Clear Translation
zh_hans: 清空翻译
zh_hant: 清空翻譯

# languageSelectSheetTitle
source: Select Translation Language
zh_hans: 选择翻译语言
zh_hant: 選擇翻譯語言

# logSettingsAutoDelete
source: Auto-delete
zh_hans: 自动删除
zh_hant: 自動刪除

# logSettingsAutoDeleteDays
source: %lld days
zh_hans: %lld 天
zh_hant: %lld 天

# logSettingsAutoDeleteDisabled
source: Disabled
zh_hans: 不启用
zh_hant: 不啟用

# logSettingsAutoDeleteSubtitle
source: Delete logs older than specified days
zh_hans: 删除超过指定天数的日志
zh_hant: 刪除超過指定天數的日誌

# logSettingsMaxSize
source: Max Log Size
zh_hans: 日志大小上限
zh_hant: 日誌大小上限

# logSettingsMaxSizeSubtitle
source: Oldest logs deleted when exceeded
zh_hans: 超出后将删除最早的日志
zh_hant: 超出後將刪除最早的日誌

# logSettingsMaxSizeUnlimited
source: Unlimited
zh_hans: 不限制
zh_hant: 不限制

# logSettingsSaveOutput
source: Save Response Output
zh_hans: 保存响应输出
zh_hant: 保存回應輸出

# logSettingsSaveOutputSubtitle
source: Log response body content (may use significant storage)
zh_hans: 记录响应体内容（可能占用较多存储空间）
zh_hant: 記錄回應本文內容（可能佔用較多儲存空間）

# logSettingsTitle
source: Log Settings
zh_hans: 日志设置
zh_hant: 日誌設定

# logViewerCurrentLog
source: Current Log
zh_hans: 当前日志
zh_hant: 目前日誌

# logViewerEmpty
source: No logs yet
zh_hans: 暂无日志
zh_hant: 暫無日誌

# logViewerErrorTitle
source: Error
zh_hans: 错误
zh_hant: 錯誤

# logViewerExport
source: Export
zh_hans: 导出
zh_hant: 匯出

# logViewerFieldDuration
source: Duration
zh_hans: 耗时
zh_hant: 耗時

# logViewerFieldEnded
source: Ended
zh_hans: 结束
zh_hant: 結束

# logViewerFieldMethod
source: Method
zh_hans: 方法
zh_hant: 方法

# logViewerFieldStarted
source: Started
zh_hans: 开始
zh_hant: 開始

# logViewerFieldStatus
source: Status
zh_hans: 状态
zh_hant: 狀態

# logViewerMoreCount
source: +%lld more
zh_hans: +%lld 条更多
zh_hant: +%lld 條更多

# logViewerOpenFolder
source: Open Logs Folder
zh_hans: 打开日志目录
zh_hant: 開啟日誌目錄

# logViewerRequestsCount
source: %lld requests
zh_hans: %lld 条请求
zh_hant: %lld 個請求

# logViewerSectionParameters
source: Parameters
zh_hans: 参数
zh_hant: 參數

# logViewerSectionRequestBody
source: Request Body
zh_hans: 请求体
zh_hant: 請求本文

# logViewerSectionRequestHeaders
source: Request Headers
zh_hans: 请求头
zh_hant: 請求標頭

# logViewerSectionResponseBody
source: Response Body
zh_hans: 响应体
zh_hant: 回應本文

# logViewerSectionResponseHeaders
source: Response Headers
zh_hans: 响应头
zh_hant: 回應標頭

# logViewerSectionSummary
source: Summary
zh_hans: 概览
zh_hant: 概覽

# logViewerSectionWarnings
source: Warnings
zh_hans: 警告
zh_hant: 警告

# logViewerTitle
source: Request Logs
zh_hans: 请求日志
zh_hant: 請求日誌

# mcpAssistantSheetClearAll
source: Clear
zh_hans: 全不选
zh_hant: 全不選

# mcpAssistantSheetSelectAll
source: Select All
zh_hans: 全选
zh_hant: 全選

# mcpAssistantSheetSubtitle
source: Servers enabled for this assistant
zh_hans: 为该助手启用的服务
zh_hant: 為該助理啟用的服務

# mcpAssistantSheetTitle
source: MCP Servers
zh_hans: MCP服务器
zh_hant: MCP伺服器

# mcpConversationSheetClearAll
source: Clear
zh_hans: 全不选
zh_hant: 全不選

# mcpConversationSheetConnected
source: Connected
zh_hans: 已连接
zh_hant: 已連線

# mcpConversationSheetNoRunning
source: No running MCP servers
zh_hans: 暂无已启动的 MCP 服务器
zh_hant: 暫無已啟動的 MCP 伺服器

# mcpConversationSheetSelectAll
source: Select All
zh_hans: 全选
zh_hant: 全選

# mcpConversationSheetSubtitle
source: Select servers enabled for this conversation
zh_hans: 选择在此助手中启用的服务
zh_hant: 選擇在此助理中啟用的服務

# mcpConversationSheetTitle
source: MCP Servers
zh_hans: MCP服务器
zh_hant: MCP伺服器

# mcpConversationSheetToolsCount
source: Tools: %1$lld/%2$lld
zh_hans: 工具: %1$lld/%2$lld
zh_hant: 工具: %1$lld/%2$lld

# mcpJsonEditButtonTooltip
source: Edit JSON
zh_hans: 编辑 JSON
zh_hant: 編輯 JSON

# mcpJsonEditParseFailed
source: JSON parse failed
zh_hans: JSON 解析失败
zh_hant: JSON 解析失敗

# mcpJsonEditSavedApplied
source: Saved and applied
zh_hans: 已保存并应用
zh_hant: 已儲存並套用

# mcpJsonEditTitle
source: Edit JSON
zh_hans: 编辑json
zh_hant: 編輯 JSON

# mcpPageAddMcpTooltip
source: Add MCP
zh_hans: 添加 MCP
zh_hant: 新增 MCP

# mcpPageBackTooltip
source: Back
zh_hans: 返回
zh_hant: 返回

# mcpPageCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# mcpPageClose
source: Close
zh_hans: 关闭
zh_hant: 關閉

# mcpPageConfirmDeleteContent
source: This can be undone via Undo. Delete?
zh_hans: 删除后可通过撤销恢复。是否删除？
zh_hant: 刪除後可透過撤銷還原。是否刪除？

# mcpPageConfirmDeleteTitle
source: Confirm Delete
zh_hans: 确认删除
zh_hant: 確認刪除

# mcpPageConnectionFailed
source: Connection failed
zh_hans: 连接失败
zh_hant: 連線失敗

# mcpPageDelete
source: Delete
zh_hans: 删除
zh_hant: 刪除

# mcpPageDetails
source: Details
zh_hans: 详情
zh_hant: 詳情

# mcpPageErrorDialogTitle
source: Connection Error
zh_hans: 连接错误
zh_hant: 連線錯誤

# mcpPageErrorNoDetails
source: No details
zh_hans: 未提供错误详情
zh_hant: 未提供錯誤詳情

# mcpPageNoServers
source: No MCP servers
zh_hans: 暂无 MCP 服务器
zh_hant: 暫無 MCP 伺服器

# mcpPageReconnect
source: Reconnect
zh_hans: 重新连接
zh_hant: 重新連線

# mcpPageServerDeleted
source: Server deleted
zh_hans: 已删除服务器
zh_hant: 已刪除伺服器

# mcpPageStatusConnected
source: Connected
zh_hans: 已连接
zh_hant: 已連線

# mcpPageStatusConnecting
source: Connecting…
zh_hans: 连接中…
zh_hant: 連線中…

# mcpPageStatusDisabled
source: Disabled
zh_hans: 已禁用
zh_hant: 已停用

# mcpPageStatusDisconnected
source: Disconnected
zh_hans: 未连接
zh_hant: 未連線

# mcpPageToolsCount
source: Tools: %1$lld/%2$lld
zh_hans: 工具: %1$lld/%2$lld
zh_hant: 工具: %1$lld/%2$lld

# mcpPageUndo
source: Undo
zh_hans: 撤销
zh_hant: 撤銷

# mcpServerEditSheetAddHeader
source: Add Header
zh_hans: 添加请求头
zh_hant: 新增請求標頭

# mcpServerEditSheetCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# mcpServerEditSheetCustomHeadersTitle
source: Custom Headers
zh_hans: 自定义请求头
zh_hant: 自訂請求標頭

# mcpServerEditSheetEnabledLabel
source: Enabled
zh_hans: 是否启用
zh_hant: 是否啟用

# mcpServerEditSheetHeaderNameHint
source: e.g. Authorization
zh_hans: 如 Authorization
zh_hant: 如 Authorization

# mcpServerEditSheetHeaderNameLabel
source: Header Name
zh_hans: 请求头名称
zh_hant: 請求標頭名稱

# mcpServerEditSheetHeaderValueHint
source: e.g. Bearer xxxxxx
zh_hans: 如 Bearer xxxxxx
zh_hant: 如 Bearer xxxxxx

# mcpServerEditSheetHeaderValueLabel
source: Header Value
zh_hans: 请求头值
zh_hant: 請求標頭值

# mcpServerEditSheetNameLabel
source: Name
zh_hans: 名称
zh_hant: 名稱

# mcpServerEditSheetNoToolsHint
source: No tools, tap refresh to sync
zh_hans: 暂无工具，点击上方同步
zh_hant: 暫無工具，點擊上方同步

# mcpServerEditSheetRemoveHeaderTooltip
source: Remove
zh_hans: 删除
zh_hant: 刪除

# mcpServerEditSheetSave
source: Save
zh_hans: 保存
zh_hant: 儲存

# mcpServerEditSheetSseRetryHint
source: If SSE fails, try a few times
zh_hans: 如果SSE连接失败，请多试几次
zh_hant: 如果SSE連線失敗，請多試幾次

# mcpServerEditSheetStdioAddEnv
source: Add Env
zh_hans: 添加环境变量
zh_hant: 新增環境變數

# mcpServerEditSheetStdioArgumentsLabel
source: Arguments
zh_hans: 参数
zh_hant: 參數

# mcpServerEditSheetStdioCommandLabel
source: Command
zh_hans: 命令
zh_hant: 命令

# mcpServerEditSheetStdioCommandRequired
source: Command is required for STDIO
zh_hans: STDIO 需要填写命令
zh_hant: STDIO 需要填寫命令

# mcpServerEditSheetStdioEnvNameLabel
source: Name
zh_hans: 名称
zh_hant: 名稱

# mcpServerEditSheetStdioEnvValueLabel
source: Value
zh_hans: 值
zh_hant: 值

# mcpServerEditSheetStdioEnvironmentTitle
source: Environment
zh_hans: 环境变量
zh_hant: 環境變數

# mcpServerEditSheetStdioOnlyDesktop
source: STDIO is only available on desktop
zh_hans: STDIO 仅在桌面端可用
zh_hant: STDIO 僅在桌面端可用

# mcpServerEditSheetStdioWorkingDirectoryLabel
source: Working Directory (optional)
zh_hans: 工作目录（可选）
zh_hant: 工作目錄（可選）

# mcpServerEditSheetSyncToolsTooltip
source: Sync Tools
zh_hans: 同步工具
zh_hant: 同步工具

# mcpServerEditSheetTabBasic
source: Basic
zh_hans: 基础设置
zh_hant: 基礎設定

# mcpServerEditSheetTabTools
source: Tools
zh_hans: 工具
zh_hant: 工具

# mcpServerEditSheetTitleAdd
source: Add MCP
zh_hans: 添加 MCP
zh_hant: 新增 MCP

# mcpServerEditSheetTitleEdit
source: Edit MCP
zh_hans: 编辑 MCP
zh_hant: 編輯 MCP

# mcpServerEditSheetTransportLabel
source: Transport
zh_hans: 传输类型
zh_hant: 傳輸類型

# mcpServerEditSheetUrlLabel
source: Server URL
zh_hans: 服务器地址
zh_hant: 伺服器地址

# mcpServerEditSheetUrlRequired
source: Please enter server URL
zh_hans: 请输入服务器地址
zh_hant: 請輸入伺服器地址

# mcpTimeoutDialogTitle
source: Tool call timeout
zh_hans: 工具调用超时
zh_hant: 工具呼叫逾時

# mcpTimeoutInvalid
source: Enter a positive number of seconds
zh_hans: 请输入大于 0 的秒数
zh_hant: 請輸入大於 0 的秒數

# mcpTimeoutSecondsLabel
source: Tool call timeout (seconds)
zh_hans: 工具调用超时（秒）
zh_hant: 工具呼叫逾時（秒）

# mcpTimeoutSettingsTooltip
source: Set tool call timeout
zh_hans: 设置工具调用超时
zh_hant: 設定工具呼叫逾時

# mcpTransportTagInmemory
source: Built-in
zh_hans: 内置
zh_hant: 內建

# mermaidExportFailed
source: Export failed
zh_hans: 导出失败
zh_hant: 匯出失敗

# mermaidExportPng
source: Export PNG
zh_hans: 导出 PNG
zh_hant: 匯出 PNG

# mermaidPreviewOpen
source: Open Preview
zh_hans: 浏览器预览
zh_hant: 瀏覽器預覽

# mermaidPreviewOpenFailed
source: Cannot open preview
zh_hans: 无法打开预览
zh_hant: 無法打開預覽

# messageEditPageHint
source: Enter message…
zh_hans: 输入消息内容…
zh_hant: 輸入訊息內容…

# messageEditPageSave
source: Save
zh_hans: 保存
zh_hant: 儲存

# messageEditPageSaveAndSend
source: Save & Send
zh_hans: 保存并发送
zh_hant: 儲存並發送

# messageEditPageTitle
source: Edit Message
zh_hans: 编辑消息
zh_hant: 編輯訊息

# messageExportSheetAssistant
source: Assistant
zh_hans: 助手
zh_hant: 助理

# messageExportSheetBatchExportImageSubtitle
source: Render selected messages to a PNG image
zh_hans: 将选中的消息渲染为 PNG 图片
zh_hant: 將選中的訊息渲染為 PNG 圖片

# messageExportSheetBatchMarkdownSubtitle
source: Export selected messages as a Markdown file
zh_hans: 将选中的消息导出为 Markdown 文件
zh_hant: 將選中的訊息匯出為 Markdown 檔案

# messageExportSheetBatchTxtSubtitle
source: Export selected messages as a TXT file
zh_hans: 将选中的消息导出为 TXT 文件
zh_hant: 將選中的訊息匯出為 TXT 檔案

# messageExportSheetDateTimeWithSecondsPattern
source: yyyy-MM-dd HH:mm:ss
zh_hans: yyyy年M月d日 HH:mm:ss
zh_hant: yyyy年M月d日 HH:mm:ss

# messageExportSheetDefaultTitle
source: New Chat
zh_hans: 新对话
zh_hant: 新對話

# messageExportSheetExportFailed
source: Export failed: %@
zh_hans: 导出失败: %@
zh_hant: 匯出失敗: %@

# messageExportSheetExportImage
source: Export as Image
zh_hans: 导出为图片
zh_hant: 匯出為圖片

# messageExportSheetExportedAs
source: Exported as %@
zh_hans: 已导出为 %@
zh_hant: 已匯出為 %@

# messageExportSheetExporting
source: Exporting…
zh_hans: 正在导出…
zh_hant: 正在匯出…

# messageExportSheetFormatTitle
source: Export Format
zh_hans: 导出格式
zh_hant: 匯出格式

# messageExportSheetPlainText
source: Plain Text
zh_hans: 纯文本
zh_hant: 純文字

# messageExportSheetShowThinkingAndToolCards
source: Show Deep Thinking and tool cards
zh_hans: 显示思考卡片和工具卡片
zh_hant: 顯示深度思考卡片與工具卡片

# messageExportSheetShowThinkingContent
source: Show thinking content
zh_hans: 显示思考内容
zh_hant: 顯示思考內容

# messageExportSheetSingleExportImageSubtitle
source: Render this message to a PNG image
zh_hans: 将该消息渲染为 PNG 图片
zh_hant: 將該訊息渲染為 PNG 圖片

# messageExportSheetSingleMarkdownSubtitle
source: Export this message as a Markdown file
zh_hans: 将该消息导出为 Markdown 文件
zh_hant: 將該訊息匯出為 Markdown 檔案

# messageExportSheetSingleTxtSubtitle
source: Export this message as a TXT file
zh_hans: 将该消息导出为 TXT 文件
zh_hant: 將該訊息匯出為 TXT 檔案

# messageExportThinkingContentLabel
source: Thinking content
zh_hans: 思考内容
zh_hant: 思考內容

# messageMoreSheetCreateBranch
source: Create Branch
zh_hans: 创建分支
zh_hant: 建立分支

# messageMoreSheetDelete
source: Delete
zh_hans: 删除
zh_hant: 刪除

# messageMoreSheetEdit
source: Edit
zh_hans: 编辑
zh_hant: 編輯

# messageMoreSheetNotImplemented
source: Not yet implemented
zh_hans: 暂未实现
zh_hant: 暫未實現

# messageMoreSheetRenderWebView
source: Render Web View
zh_hans: 网页视图渲染
zh_hant: 網頁視圖渲染

# messageMoreSheetSelectCopy
source: Select & Copy
zh_hans: 选择复制
zh_hant: 選擇複製

# messageMoreSheetShare
source: Share
zh_hans: 分享
zh_hant: 分享

# messageMoreSheetTitle
source: More Actions
zh_hans: 更多操作
zh_hant: 更多操作

# messageWebViewConsoleLogs
source: Console Logs
zh_hans: 控制台日志
zh_hant: 控制台日誌

# messageWebViewForwardTooltip
source: Forward
zh_hans: 前进
zh_hant: 前進

# messageWebViewNoConsoleMessages
source: No console messages
zh_hans: 暂无控制台消息
zh_hant: 暫無控制台訊息

# messageWebViewOpenInBrowser
source: Open in Browser
zh_hans: 在浏览器中打开
zh_hant: 在瀏覽器中開啟

# messageWebViewRefreshTooltip
source: Refresh
zh_hans: 刷新
zh_hant: 重新整理

# miniMapScrollToBottomTooltip
source: Scroll to bottom
zh_hans: 滚动到底部
zh_hant: 捲動到底部

# miniMapTitle
source: Minimap
zh_hans: 迷你地图
zh_hant: 迷你地圖

# miniMapTooltip
source: Minimap
zh_hans: 迷你地图
zh_hant: 迷你地圖

# modelDetailSheetAbilitiesLabel
source: Abilities
zh_hans: 能力
zh_hant: 能力

# modelDetailSheetAddBody
source: Add Body
zh_hans: 添加 Body
zh_hant: 新增 Body

# modelDetailSheetAddButton
source: Add
zh_hans: 添加
zh_hant: 新增

# modelDetailSheetAddHeader
source: Add Header
zh_hans: 添加 Header
zh_hant: 新增 Header

# modelDetailSheetAddModel
source: Add Model
zh_hans: 添加模型
zh_hant: 新增模型

# modelDetailSheetAddProviderOverride
source: Add Provider Override
zh_hans: 添加供应商重写
zh_hant: 新增供應商覆寫

# modelDetailSheetAdvancedTab
source: Advanced
zh_hans: 高级设置
zh_hant: 進階設定

# modelDetailSheetBasicTab
source: Basic
zh_hans: 基本设置
zh_hant: 基本設定

# modelDetailSheetBuiltinToolsDescription
source: Built-in tools only support official APIs.
zh_hans: 内置工具仅支持官方 API。
zh_hant: 內建工具僅支援官方 API。

# modelDetailSheetBuiltinToolsTab
source: Built-in Tools
zh_hans: 内置工具
zh_hant: 內建工具

# modelDetailSheetBuiltinToolsUnsupportedHint
source: Current provider does not support these built-in tools.
zh_hans: 当前供应商不支持这些内置工具。
zh_hant: 目前供應商不支援這些內建工具。

# modelDetailSheetCancelButton
source: Cancel
zh_hans: 取消
zh_hant: 取消

# modelDetailSheetChatType
source: Chat
zh_hans: 聊天
zh_hant: 聊天

# modelDetailSheetCodeExecutionTool
source: Code Execution
zh_hans: 代码执行
zh_hant: 程式碼執行

# modelDetailSheetCodeExecutionToolDescription
source: Enable code execution tool
zh_hans: 启用代码执行工具
zh_hant: 啟用程式碼執行工具

# modelDetailSheetConfirmButton
source: Confirm
zh_hans: 确认
zh_hant: 確認

# modelDetailSheetCustomBodyTitle
source: Custom Body
zh_hans: 自定义 Body
zh_hant: 自訂 Body

# modelDetailSheetCustomHeadersTitle
source: Custom Headers
zh_hans: 自定义 Headers
zh_hant: 自訂 Headers

# modelDetailSheetEditModel
source: Edit Model
zh_hans: 编辑模型
zh_hant: 編輯模型

# modelDetailSheetEmbeddingType
source: Embedding
zh_hans: 嵌入
zh_hant: 嵌入

# modelDetailSheetGeminiCodeExecutionMutuallyExclusiveHint
source: Code execution cannot coexist with Search/URL Context/MCP tools.
zh_hans: 代码执行无法与搜索/URL 上下文/MCP 工具共存。
zh_hant: 程式碼執行無法與搜尋/URL 上下文/MCP 工具共存。

# modelDetailSheetImageMode
source: Image
zh_hans: 图片
zh_hant: 圖片

# modelDetailSheetInputModesLabel
source: Input Modes
zh_hans: 输入模式
zh_hant: 輸入模式

# modelDetailSheetInvalidIdError
source: Please enter a valid model ID (>=2 chars)
zh_hans: 请输入有效的模型 ID（不少于2个字符）
zh_hant: 請輸入有效的模型 ID（不少於2個字元）

# modelDetailSheetModelIdExistsError
source: Model ID already exists
zh_hans: 模型 ID 已存在
zh_hant: 模型 ID 已存在

# modelDetailSheetModelIdHint
source: Required, suggest lowercase/digits/hyphens
zh_hans: 必填，建议小写字母、数字、连字符
zh_hant: 必填，建議小寫字母、數字、連字號

# modelDetailSheetModelIdLabel
source: Model ID
zh_hans: 模型 ID
zh_hant: 模型 ID

# modelDetailSheetModelNameLabel
source: Model Name
zh_hans: 模型名称
zh_hant: 模型名稱

# modelDetailSheetModelTypeLabel
source: Model Type
zh_hans: 模型类型
zh_hant: 模型類型

# modelDetailSheetOpenaiBuiltinToolsResponsesOnlyHint
source: Requires OpenAI Responses API.
zh_hans: 需要启用 OpenAI Responses API。
zh_hant: 需要啟用 OpenAI Responses API。

# modelDetailSheetOpenaiCodeInterpreterTool
source: Code Interpreter
zh_hans: 代码解释器
zh_hant: 程式碼解譯器

# modelDetailSheetOpenaiCodeInterpreterToolDescription
source: Enable code interpreter tool (container auto, memory limit 4g)
zh_hans: 启用代码解释器工具（容器自动，内存上限 4g）
zh_hant: 啟用程式碼解譯器工具（容器自動，記憶體上限 4g）

# modelDetailSheetOpenaiImageGenerationTool
source: Image Generation
zh_hans: 图像生成
zh_hant: 圖像生成

# modelDetailSheetOpenaiImageGenerationToolDescription
source: Enable image generation tool
zh_hans: 启用图像生成工具
zh_hant: 啟用圖像生成工具

# modelDetailSheetOutputModesLabel
source: Output Modes
zh_hans: 输出模式
zh_hant: 輸出模式

# modelDetailSheetProviderOverrideDescription
source: Provider overrides: customize provider for a specific model.
zh_hans: 供应商重写：允许为特定模型自定义供应商设置。（暂未实现）
zh_hant: 供應商覆寫：允許為特定模型自訂供應商設定。（暫未實現）

# modelDetailSheetReasoningAbility
source: Reasoning
zh_hans: 推理
zh_hant: 推理

# modelDetailSheetSaveFailedMessage
source: Save failed. Please try again.
zh_hans: 保存失败，请重试
zh_hant: 保存失敗，請重試

# modelDetailSheetSearchTool
source: Search
zh_hans: 搜索
zh_hant: 搜尋

# modelDetailSheetSearchToolDescription
source: Enable Google Search integration
zh_hans: 启用 Google 搜索集成
zh_hant: 啟用 Google 搜尋整合

# modelDetailSheetTextMode
source: Text
zh_hans: 文本
zh_hant: 文字

# modelDetailSheetToolsAbility
source: Tools
zh_hans: 工具
zh_hant: 工具

# modelDetailSheetUrlContextTool
source: URL Context
zh_hans: URL 上下文
zh_hant: URL 上下文

# modelDetailSheetUrlContextToolDescription
source: Enable URL content ingestion
zh_hans: 启用 URL 内容处理
zh_hant: 啟用 URL 內容處理

# modelDetailSheetYoutubeToolDescription
source: Enable YouTube URL ingestion (auto-detect links in prompts)
zh_hans: 启用 YouTube 链接读取（自动识别提示词中的链接）
zh_hant: 啟用 YouTube 連結讀取（自動辨識提示詞中的連結）

# modelFetchInvertTooltip
source: Invert
zh_hans: 反选
zh_hant: 反選

# modelSelectSheetChatType
source: Chat
zh_hans: 聊天
zh_hant: 聊天

# modelSelectSheetEmbeddingType
source: Embedding
zh_hans: 嵌入
zh_hant: 嵌入

# modelSelectSheetFavoriteTooltip
source: Favorite
zh_hans: 收藏
zh_hant: 收藏

# modelSelectSheetFavoritesSection
source: Favorites
zh_hans: 收藏
zh_hant: 收藏

# modelSelectSheetSearchHint
source: Search models or providers
zh_hans: 搜索模型或服务商
zh_hant: 搜尋模型或供應商

# multiKeyPageAccuracy
source: Accuracy
zh_hans: 正确率
zh_hant: 正確率

# multiKeyPageAdd
source: Add
zh_hans: 添加
zh_hant: 新增

# multiKeyPageAddHint
source: Enter API keys, separated by comma or space
zh_hans: 请输入API Key（多个用逗号或空格分隔）
zh_hant: 請輸入 API Key（多個以逗號或空格分隔）

# multiKeyPageAlias
source: Alias
zh_hans: 别名
zh_hant: 別名

# multiKeyPageCancel
source: Cancel
zh_hans: 取消
zh_hant: 取消

# multiKeyPageDelete
source: Delete
zh_hans: 删除
zh_hant: 刪除

# multiKeyPageDeleteErrorsConfirmContent
source: This will remove all keys marked as error.
zh_hans: 这将移除所有状态为错误的 Key。
zh_hant: 這將移除所有狀態為錯誤的 Key。

# multiKeyPageDeleteErrorsConfirmTitle
source: Delete all error keys?
zh_hans: 删除所有错误的 Key？
zh_hant: 刪除所有錯誤的 Key？

# multiKeyPageDeleteErrorsTooltip
source: Delete errors
zh_hans: 删除错误
zh_hant: 刪除錯誤
